---
kind: type
id: T:Autodesk.Revit.DB.Structure.EndTreatmentType
source: html/107f2dd4-7a92-e67e-0b79-a1c8c87dbf35.htm
---
# Autodesk.Revit.DB.Structure.EndTreatmentType

An end treatment type object that is used to hold information about the end treatment applied to bars that are connected to a coupler.

## Syntax (C#)
```csharp
public class EndTreatmentType : ElementType
```